---
title: GeometryElement
classe: Autodesk.Revit.DB.GeometryElement
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GeometryObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# GeometryElement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Material MaterialElement { get; }` | `geometryElement.MaterialElement` | Material |
| `BoundingBoxXYZ GetBoundingBox()` | `geometryElement.GetBoundingBox()` | BoundingBoxXYZ |
| `IEnumerator<GeometryObject> GetEnumerator()` | `geometryElement.GetEnumerator()` | IEnumerator<GeometryObject> |
| `GeometryElement GetTransformed(Transform)` | `geometryElement.GetTransformed(transform)` | GeometryElement |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```